dlls/BingGeneralRequestTemplate_NoLocation.xml

<?xml version="1.0" encoding="utf-8"?><e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Body><s:SearchWithNifEnabled xmlns:s="http://schemas.microsoft.com/MobileSearch/v1/Search" xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><s:request><Context><ApplicationId>%1</ApplicationId><UserId>%2</UserId><Version>%3</Version><Culture>%4</Culture></Context><Properties><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Highlight</Key><Value>true</Value></KeyValueOfstringstring></Properties><Queries><QueryInformation><Domains><DomainInformation><Domain>%9</Domain></DomainInformation><DomainInformation><Domain>AppIntent</Domain><Range><Count>1</Count><Detail><AppIntent><AppStoreRequests><AppStoreRequest><AppResultsCount>%17</AppResultsCount><AppStoreId>3</AppStoreId><MobileDeviceTypeId>%18</MobileDeviceTypeId></AppStoreRequest></AppStoreRequests></AppIntent></Detail></Range></DomainInformation></Domains><QueryString>%5</QueryString></QueryInformation></Queries></s:request></s:SearchWithNifEnabled></e:Body></e:Envelope>
